OpenNuvoton/ISPTool/Firmwares/NUC122BSP/Library/Device/Nuvoton/NUC122/Include/NUC122.h
    /**
     * GPB_MFP
     * ===================================================================================================
     * Offset: 0x34  GPIOB Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |GPB_MFP0  |PB.0 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP0.     
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = UART0_RXD function is selected.
     * |[1]     |GPB_MFP1  |PB.1 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP1.     
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = UART0_TXD0 function is selected.
     * |[2]     |GPB_MFP2  |PB.2 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP2 and ALT_MFP[11].
     * |        |          |(ALT_MFP[11], GPB_MFP2) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART0_nRTS function is selected.
     * |[3]     |GPB_MFP3  |PB.3 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP3 and ALT_MFP[11].
     * |        |          |(ALT_MFP[11], GPB_MFP3) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART0_nCTS function is selected.
     * |[4]     |GPB_MFP4  |PB.4 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP4 and ALT_MFP[15].
     * |        |          |(ALT_MFP[15], GPB_MFP4) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART1_RXD function is selected.
     * |        |          |(1, 1) = SPI1_SS1 function is selected.
     * |[5]     |GPB_MFP5  |PB.5 Pin Function Selection
     * |        |          |0 = The GPIOB[5] is selected to the pin PB.5        
     * |        |          |1 = The UART1 TXD function is selected to the pin PB.5     
     * |[6]     |GPB_MFP6  |PB.6 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP6 and ALT_MFP[17].
     * |        |          |(ALT_MFP[17], GPB_MFP6) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART1_nRTS function is selected.
     * |[7]     |GPB_MFP7  |PB.7 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP7 and ALT_MFP[16].
     * |        |          |(ALT_MFP[16], GPB_MFP7) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART1_nCTS function is selected.
     * |[8]     |GPB_MFP8  |PB.8 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP8.     
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = TM0 function is selected.
     * |[9]     |GPB_MFP9  |PB.9 Pin Function Selection
     * |        |          |Bits PB9_S11(ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
     * |        |          |(PB9_S11 (ALT_MFP[1]), GPB_MFP9) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM1 function is selected.
     * |        |          |(1, 1) = SPI1_SS1 function is selected.
     * |[10]    |GPB_MFP10 |PB.10 Pin Function Selection
     * |        |          |Bits PB10_S01(ALT_MFP[0]) and GPB_MFP[10] determine the PB.10 function.
     * |        |          |(PB10_S01 (ALT_MFP[0]), GPB_MFP10) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM2 function is selected.
     * |        |          |(1, 1) = SPI0_SS1 function is selected.
     * |[14]    |GPB_MFP14 |PB.14 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP14 and ALT_MFP[3].
     * |        |          |(ALT_MFP[3], GPB_MFP14) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = INT0 function is selected.  
     * |[15]    |GPB_MFP15 |PB.15 Pin Function Selection
     * |        |          |The pin function depends on GPB_MFP15.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = INT1 function is selected.       
     * |[31:16] |GPB_TYPEn |Trigger Function Selection
     * |        |          |0 = GPIOB[15:0] I/O input Schmitt Trigger function Disabled. 
     * |        |          |1 = GPIOB[15:0] I/O input Schmitt Trigger function Enabled.
     */
    __IO uint32_t GPB_MFP;

    /**
     * GPC_MFP
     * ===================================================================================================
     * Offset: 0x38  GPIOC Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |GPC_MFP0  |PC.0 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[0] and ALT_MFP[5].
     * |        |          |(ALT_MFP[5], GPC_MFP[0]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI0_SS0 function is selected.
     * |[1]     |GPC_MFP1  |PC.1 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[1] and ALT_MFP[6].     
     * |        |          |(ALT_MFP[6]), GPC_MFP[1]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI0_CLK function is selected.
     * |[2]     |GPC_MFP2  |PC.2 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[2] and ALT_MFP[7].     
     * |        |          |ALT_MFP[7] and GPC_MFP[2] determine the PC.2 function.
     * |        |          |(ALT_MFP[7], GPC_MFP[2]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI0_MISO0 function is selected.
     * |[3]     |GPC_MFP3  |PC.3 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[3] and ALT_MFP[8].     
     * |        |          |(ALT_MFP[8], GPC_MFP[3]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI0_MOSI0 function is selected.
     * |[4]     |GPC_MFP4  |PC.4 Pin Function Selection
     * |        |          |GPC_MFP[4] is needed to set 0 for GPIOC[4] function on PC.4.      
     * |[5]     |GPC_MFP5  |PC.5 Pin Function Selection
     * |        |          |GPC_MFP[5] is needed to set 0 for GPIOC[5] function on PC.5.
     * |[8]     |GPC_MFP8  |PC.8 Pin Function Selection     
     * |        |          |The pin function depends on GPC_MFP[8] and ALT_MFP[16].
     * |        |          |(ALT_MFP[16], GPC_MFP[8]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI1_SS0 function is selected.     
     * |[9]     |GPC_MFP9  |PC.9 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[9] and ALT_MFP[17].
     * |        |          |(ALT_MFP[17], GPC_MFP[9]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI1_CLK function is selected.          
     * |[10]    |GPC_MFP10 |PC.10 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[10] and ALT_MFP[18].
     * |        |          |(ALT_MFP[18], GPC_MFP[10]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI1_MISO0 function is selected.        
     * |[11]    |GPC_MFP11 |PC.11 Pin Function Selection
     * |        |          |The pin function depends on GPC_MFP[11] and ALT_MFP[19].
     * |        |          |(ALT_MFP[19], GPC_MFP[11]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = PI1_MOSI0 function is selected.        
     * |[12]    |GPC_MFP12 |PC.12 Pin Function Selection
     * |        |          |Both GPC_MFP[12] and ALT_MFP[13] are needed to set 0 for GPIOC[12] function on PC.12.
     * |[13]    |GPC_MFP13 |PC.13 Pin Function Selection
     * |        |          |Both GPC_MFP[13] and ALT_MFP[21] are needed to set 0 for GPIOC[13] function on PC.13.
     * |[31:16] |GPC_TYPEn |Trigger Function Selection
     * |        |          |0 = GPIOC[15:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = GPIOC[15:0] I/O input Schmitt Trigger function Enabled.     
     */
    __IO uint32_t GPC_MFP;

    /**
     * GPD_MFP
     * ===================================================================================================
     * Offset: 0x3C  GPIOD Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |GPD_MFP0  |PD.0 Pin Function Selection
     * |        |          |GPD_MFP[0] is needed to set 0 for GPIOD[0] function on PD.0.
     * |[1]     |GPD_MFP1  |PD.1 Pin Function Selection
     * |        |          |0 = The GPIOD[1] is selected to the pin PD.1.
     * |        |          |1 = The SPI0_SS1 function is selected to the pin PD.1.
     * |[2]     |GPD_MFP2  |PD.2 Pin Function Selection
     * |        |          |GPD_MFP[2] is needed to set 0 for GPIOD[2] function on PD.2.
     * |[3]     |GPD_MFP3  |PD.3 Pin Function Selection
     * |        |          |GPD_MFP[3] is needed to set 0 for GPIOD[3] function on PD.3.
     * |[4]     |GPD_MFP4  |PD.4 Pin Function Selection
     * |        |          |GPD_MFP[4] is needed to set 0 for GPIOD[4] function on PD.4.
     * |[5]     |GPD_MFP5  |PD.5 Pin Function Selection
     * |        |          |GPD_MFP[5] is needed to set 0 for GPIOD[5] function on PD.5.
     * |[8]     |GPD_MFP8  |PD.8 Pin Function Selection
     * |        |          |Both GPD_MFP[8] and ALT_MFP[18] are needed to set 0 for GPIOD[8] function on PD.8.
     * |[9]     |GPD_MFP9  |PD.9 Pin Function Selection
     * |        |          |Both GPD_MFP[9] and ALT_MFP[19] are needed to set 0 for GPIOD[9] function on PD.9.
     * |[10]    |GPD_MFP10 |PD.10 Pin Function Selection
     * |        |          |Both GPD_MFP[10] and ALT_MFP[20] are needed to set 0 for GPIOD[10] function on PD.10.
     * |[11]    |GPD_MFP11 |PD.11 Pin Function Selection
     * |        |          |Both GPD_MFP[11] and ALT_MFP[21] are needed to set 0 for GPIOD[11] function on PD.11.
     * |[31:16] |GPD_TYPEn |Trigger Function Selection
     * |        |          |0 = GPIOD[15:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = GPIOD[15:0] I/O input Schmitt Trigger function Enabled.
     * |        |          |GPIOD[15:12], GPIOD[7:6] are reserved.
     */
    __IO uint32_t GPD_MFP;

    /**
     * @cond HIDDEN_SYMBOLS
     */
    __I  uint32_t RESERVE3[4];
    /**
     * @endcond
     */

    /**
     * ALT_MFP
     * ===================================================================================================
     * Offset: 0x50  Alternative Multiple Function Pin Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PB10_S01  |PB.10 Pin Alternate Function Selection
     * |        |          |Bits PB10_S01 and GPB_MFP[10] determine the PB.10 function.
     * |        |          |(PB10_S01 (ALT_MFP[0]), GPB_MFP[10]) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM2 function is selected.
     * |        |          |(1, 1) = SPI0_SS1 function is selected.
     * |[1]     |PB9_S11   |PB.9 Pin Alternate Function Selection
     * |        |          |Bits PB9_S11(ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
     * |        |          |(PB9_S11 (ALT_MFP[1]), GPB_MFP9) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM1 function is selected.
     * |        |          |(1, 1) = SPI1_SS1 function is selected.
     * |[14:2]  |ALT_MFP[14:2]|Pin Alternate Function Selection
     * |        |          |They are necessary to set 0.     
     * |[15]    |ALT_MFP[15]|PB.4 Pin Alternate Function Selection
     * |        |          |The pin function depends on GPB_MFP4 and ALT_MFP[15].
     * |        |          |(ALT_MFP[15], GPB_MFP4) value and function mapping is as following list.
     * |        |          |(x, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART1_RXD function is selected.
     * |        |          |(1, 1) = SPI1_SS1 function is selected.
     * |[21:16] |ALT_MFP[14:2]|Pin Alternate Function Selection
     * |        |          |They are necessary to set 0.         
     */
    __IO uint32_t ALT_MFP;

    /**
     * @cond HIDDEN_SYMBOLS
     */
    __I  uint32_t RESERVE4[43];
    /**
     * @endcond
     */

    /**
     * REGWRPROT
     * ===================================================================================================
     * Offset: 0x100  Register Write Protect register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |REGPROTDIS|Register Write-Protection Disable index (Read Only)
     * |        |          |0 = Write-protection Enabled for writing protected registers.
     * |        |          |1 = Write-protection Disabled for writing protected registers.
     * |        |          |Any write to the protected register is ignored.
     * |        |          |The Protected registers are:
     * |        |          |IPRSTC1: address 0x5000_0008
     * |        |          |BODCR: address 0x5000_0018
     * |        |          |PORCR: address 0x5000_0024
     * |        |          |PWRCON: address 0x5000_0200 (bit[6] is not protected for power wake-up interrupt clear)
     * |        |          |APBCLK bit[0]: address 0x5000_0208 (bit[0] is Watchdog Timer clock enable)
     * |        |          |CLKSEL0: address 0x5000_0210 (for HCLK and CPU STCLK clock source select)
     * |        |          |CLKSEL1 bit[1:0]: address 0x5000_0214 (for Watchdog Timer clock source select)
     * |        |          |NMI_SEL bit[7]: address 0x5000_0380 (for interrupt test mode)
     * |        |          |ISPCON: address 0x5000_C000 (Flash ISP Control register)
     * |        |          |WTCR: address 0x4000_4000
     * |        |          |FATCON: address 0x5000_C018    
     * |[7:0]   |REGWRPROT |Register Write-Protection Code (Write Only)
     * |        |          |Some registers have write-protection function.
     * |        |          |Writing these registers has to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field.
     * |        |          |After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-protection registers can be normal write.
     */
    __IO uint32_t REGWRPROT;

} GCR_T;


